
// ДЗ 3. 


//Задача 1.Задача 19 Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.


//Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.


/*
//Задача 23. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

void OutputsCube (int n)
{
    for (int i = 1; i <= n; i++)
    {
        Console.WriteLine($"The cube of the number {i} is equal to {i*i*i};");
    }
}

Console.Write("Enter any integer: ");
int cube = Convert.ToInt32(Console.ReadLine());
OutputsCube(cube);
*/

