// Напишите программу, которая перевернёт одномерный массив (последний элемент будет на первом месте, а первый - на последнем и т.д.)
/*
Int [] ReverseArray (int [] array)
{
    for (int i=0, i<array.length, i++)
    {
        int temp = array [i];
        array[i]= array[array.length-1 - i];
        array[array.length-1-i] = temp;
    }
    return array
}

int [] CreateRandomArray(int size, int minValue, int maxValue)
{
    int[] newArray = new int [size]; // int[]- массив

    for (int i = 0; i < size; i++)
        newArray[i] = new Random().Next(minValue,maxValue + 1);

        return newArray;
}

void ShowArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
        Console.Write(array[i] + " ");
    
    Console.WriteLine();
}

*/
//Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник с сторонами такой длины.
/*
bool CheckSide (int a, int b,int c)
{
    if ((a+b>c) && (a+c>b) && (b+c>a)) return true;
    else return false;
    
}

*/

//https://github.com/IrinaChibireva/Seminars.git

