// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и 
// возводит число A в натуральную степень B.




// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму
// цифр в числе.




// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит 
// их на экран.
/*gi
int[] CreateInputArray (int size)
{
    int[] newArray = new int[size];
    for (int i = 0; i < size; i++)
    {
        Console.Write($"Input {i} element array: ");
        newArray[i] = Convert.ToInt32(Console.ReadLine());
    }
    return newArray; 
} 

void ShowArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");
    }
    Console.WriteLine();
}

Console.Write("Input size for array: ");
int a = Convert.ToInt32(Console.ReadLine());
int[] myArray = CreateInputArray (a);
ShowArray(myArray);

*/
